# NumberOfSaves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentVersion..::..NumberOfSaves Property
DocumentVersion Class See Also
---
The number of times the document has been saved. The save number and GUID are both necessary to uniquely identify a document version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int NumberOfSaves { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfSaves As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfSaves {
	int get ();
}
```

# See Also
DocumentVersion Class
Autodesk.Revit.DB Namespace